print("1.รับค่า * เข้ามาหนึ่งครั้ง จากนั้นรับตัวเลขจํานวนเต็ม แล้วให้แสดงผลลัพธ์ดังนี้")
print("Input = * และ 10 output **********")
print("หาผลลัพธ์")
variable=input("ใส่ตัวเเปรที่โจทย์กำหนดให้ : ")
times=int(input("ใส่ตัวเลขที่โจทย์กำหนดให้ : "))
output =variable * times
print(output)

print("2.เขียนโปรแกรมรับจํานวนคะแนนสอบกลางภาค และปลายภาค ซึ่งแต่ละครั้งมีคะแนนและค่าเฉลี่ยของคะแนนนสอบทั้งสองครั้ง ")
print("**กําหนดค่า Input = 50.5 และ 31.5")
midterm=float(input("ใส่คะเเนนกลางภาค :"))
if 0<=midterm<=60 :
    print("คะเเนนกลางภาค",midterm)
final=float (input("ใส่คะเเนนปลายภาค :"))
if 0<=final<=60 :
    print("คะเเนนปลายภาค",final)
total=midterm + final
average =(midterm + final)/2
print(total)
print(average)

print("3.กําหนดให้สระว่ายน้ํา เป็นรูปสี่เหลี่ยมผืนผ้า โดยเราต้องการเติมน้ําลงไปในสระให้เต็ม จงเขียนโปรแกรมเพื่อรับความกว้าง ความยาว และความลึกของสระในหน่วยเมตร เพื่อคํานวณว่าต้องใช้เวลากี่นาทีในการเติมน้ําลงในสระให้เต็ม เมื่อกําหนดให้ใช้เวลา 15 วินาทีในการเติมน้ํา 1ลูกบาศก์เมตร แสดงคําตอบด้วยทศนิยมสองตําแหน่ง")
print("กำหนดให้ กว้าง18.5 ยาว38.75 ลึก1.35 ต้องใช้เวลาในหารเติมน้ำ 241.92นาที")
wide=float(input("ใส่ค่าความกว้าง"))
long=float(input("ใส่ค่าความยาว"))
high=float(input("ใส่ค่าความสูง"))
area=wide * long * high
print("ขนาดพื้นที่ของสระว่ายน้ำ",area)
time=(area * 15)/60
print("เวลาที่ใช้ในการเติมน้ำ","%.2f"%(time),"นาที")

